YJCHOI15/s32k312-adc-configuration/S32K312_ADC/include/adc_s32k312.h
#ifndef ADC_S32K312_H
#define ADC_S32K312_H

#include <stdint.h>

/********************* MC_ME *************************/
#define MC_ME_BASE                   (0x402DC000UL)

#define MC_ME_PRTN0_PCONF_OFF        (0x100)
#define MC_ME_PRTN0_PUPD_OFF         (0x104)
#define MC_ME_PRTN0_COFB1_CLKEN_OFF  (0x134)

#define MC_ME_CTL_KEY                (*(volatile uint32_t*)(MC_ME_BASE))

#define MC_ME_PRTN0_PCONF            (*(volatile uint32_t*)(MC_ME_BASE+MC_ME_PRTN0_PCONF_OFF))
#define MC_ME_PRTN0_COFB1_CLKEN      (*(volatile uint32_t*)(MC_ME_BASE+MC_ME_PRTN0_COFB1_CLKEN_OFF))
#define MC_ME_PRTN0_PUPD             (*(volatile uint32_t*)(MC_ME_BASE+MC_ME_PRTN0_PUPD_OFF))

/* CTL_KEY fields */
#define CTL_KEY_VAL                  0x5AF0
#define CTL_KEY_INV_VAL              0xA50F

/* PRTN0_PCONF fields*/
#define PCE_BIT                      0

/* PRTN0_COFB1_CLKEN fields */
#define REQ40_BIT                    8

/* PRTN0_PUPD fields */
#define PCUD_BIT                     0

/********************* MC_CGM *************************/
#define MC_CGM_BASE            (0x402D8000UL)
#define MC_CGM_MUX_0_CSC_OFF   (0x300)
#define MC_CGM_MUX_0_DC_0_OFF  (0x308)

#define MC_CGM_MUX_0_CSC       (*(volatile uint32_t*)(MC_CGM_BASE+MC_CGM_MUX_0_CSC_OFF))
#define MC_CGM_MUX_0_DC_0      (*(volatile uint32_t*)(MC_CGM_BASE+MC_CGM_MUX_0_DC_0_OFF))

/* MUX_0_CSC fields */
#define SELCTL_SBIT            24   /* [27:24] */

/* MUX_0_DC_0 fields */
#define DIV_SBIT               16   /* [18:16] */

/********************* ADC0 *************************/
#define ADC0_BASE                   (0x400A0000UL)
#define ADC0_ISR_OFF                (0x10)
#define ADC0_NCMR0_OFF              (0xA4)
#define ADC0_PCDR0_OFF              (0x100)
#define ADC0_CALBISTREG_OFF         (0x3A0)

#define ADC0_MCR (*(volatile uint32_t*)(ADC0_BASE)) 
#define ADC0_ISR (*(volatile uint32_t*)(ADC0_BASE+ADC0_ISR_OFF)) 
#define ADC0_NCMR0 (*(volatile uint32_t*)(ADC0_BASE+ADC0_NCMR0_OFF)) 
#define ADC0_PCDR0 (*(volatile uint32_t*)(ADC0_BASE+ADC0_PCDR0_OFF)) 
#define ADC0_CALBISTREG (*(volatile uint32_t*)(ADC0_BASE+ADC0_CALBISTREG_OFF))

/* MCR fields */
#define MODE_BIT                    29      
#define NSTART_BIT                  24      
#define ADCLKSEL_SBIT               1          /* [2:1] */
#define PWDN_BIT                    0

/* ISR fields */
#define EOC_BIT                     1

/* NCMR0 fields */
#define CH0_BIT                     0     

/* PCDR0 fields */
#define VALID_BIT                   19
#define OVERW_BIT                   18
#define RESULT_SBIT                 16         /* [17:16] */
#define CDATA_MASK                  (0x7FF8)

/* CALBISTREG fields */
#define C_T_BUSY_BIT                15
#define TEST_FAIL_BIT               3
#define TEST_EN_BIT                 0

/********************함수 선언 *******************/
void ADC0_Clk_Enable(void);
void ADC0_Clk_Generate(void);
void ADC0_Init(void);
void ADC0_Start_Conversion(void);
uint16_t ADC0_Get_Result(void);

#endif
